Core/src/Documents/СдельныйНаряд/СдельныйНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СдельныйНаряд</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.СдельныеНаряды</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияИУдержания</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПерсоналом</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Бригады</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <comment>Норма времени на выполнение операции в минутах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Нормочасы</name>
      <comment>Продолжительность операций в минутах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставБригады</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Documents/ЗаказНаПроизводство/ЗаказНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказНаПроизводство</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВЗапасах</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.РазмещениеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ГрафикДвиженияЗапасов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗавершения</name>
    <type>
      <types>EnumRef.ВариантыЗавершенияЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводствоОснование</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Заметки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>CatalogRef.СостоянияЗаказовНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокНоменклатуры</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокРесурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Старт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаРезерв</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Финиш</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyJiraCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатуры</name>
      <type>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyПартииНоменклатуры</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyНаименованияПоставщиков</name>
      <type>
        <types>CatalogRef.AzRyНаименованияПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyРезервЗакупки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyПриоритет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyКоментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РесурсыПредприятия</name>
    <attributes>
      <name>РесурсПредприятия</name>
      <type>
        <types>CatalogRef.КлючевыеРесурсы</types>
      </type>
    </attributes>
    <attributes>
      <name>Мощность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Старт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Финиш</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/СдельныйНаряд/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	ЭтотОбъект.ОснованиеСоздания = Параметры.Основание;
	
	Компания = УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Объект.Организация);
	
	Если ТипЗнч(Объект.Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
		ТабНомер = Объект.Исполнитель.Код;
	Иначе
		ТабНомер = "";
	КонецЕсли;
	
	Элементы.ДатаЗакрытия.АвтоОтметкаНезаполненного = Объект.Закрыт;
	
	Если НЕ Константы.ФункциональнаяОпцияИспользоватьСовместительство.Получить() Тогда
		Если Элементы.Найти("СоставБригадыСотрудникКод") <> Неопределено Тогда		
			Элементы.СоставБригадыСотрудникКод.Видимость = Ложь;		
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОповеститьРабочийКалендарь = Ложь;	
	Иначе
		ОповеститьРабочийКалендарь = Истина;
	КонецЕсли; 
	ДокументМодифицирован = Ложь;
	
	Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Объект.ДокументОснование);
	ЗаполнитьСписокДокументОснование();
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	// КопированиеСтрокТабличныхЧастей
	КопированиеТабличнойЧастиСервер.ПриСозданииНаСевере(Элементы, "Операции");
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтатистикаИспользованияФормКлиент.ПроверитьЗаписатьСтатистикуКоманды(
		"СоздатьНаОсновании.СдельныйНаряд",
		ЭтотОбъект.ВладелецФормы,
		ЭтотОбъект.ОснованиеСоздания
	);
	
	УправлениеФормой();
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
// Процедура - обработчик события ПослеЗаписи.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ДокументМодифицирован Тогда
		ОповеститьРабочийКалендарь = Истина;
		ДокументМодифицирован = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, "Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
	
КонецПроцедуры

&НаСервере
// Процедура обработчик события ПередЗаписьюНаСервере.
// Осуществляет первоначальное заполнение реквизитов формы.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Модифицированность Тогда
		ДокументМодифицирован = Истина;	
	КонецЕсли;
	
	// Обсуждения
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность",Модифицированность);
	// Конец Обсуждения
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Процедура - обработчик события ОбработкаОповещения формы.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// КопированиеСтрокТабличныхЧастей
	Если ИмяСобытия = "БуферОбменаТабличнаяЧастьКопированиеСтрок" Тогда
		КопированиеТабличнойЧастиКлиент.ОбработкаОповещения(Элементы, "Операции");
	КонецЕсли;
	
	// Обсуждения
	ОбсужденияКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения

КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
Процедура ДатаПриИзменении(Элемент)
	
	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДатаПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Организация.
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
Процедура ОрганизацияПриИзменении(Элемент)

	// Обработка события изменения организации.
	Объект.Номер = "";
	СтруктураДанные = ПолучитьДанныеОрганизацияПриИзменении(Объект.Организация);
	Компания = СтруктураДанные.Компания;
	
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Исполнитель.
//
Процедура ИсполнительПриИзменении(Элемент)
	
	УправлениеФормой();
	Объект.СоставБригады.Очистить();
	
	Если ТипЗнч(Объект.Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда		
		ТабНомер = ПолучитьТабНомер(Объект.Исполнитель);
		
	Иначе
		ТабНомер = "";
		Объект.ВидУдержанияНДФЛ = Неопределено;
		Объект.ВидУдержанияПФ   = Неопределено;
		Объект.СуммаНДФЛ        = 0;
		Объект.СуммаПФ          = 0;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Закрыт.
//
Процедура ЗакрытПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаЗакрытия) И Объект.Закрыт Тогда
		Объект.ДатаЗакрытия = ТекущаяДата();	
	КонецЕсли;
	
	Если Объект.Закрыт Тогда
		Элементы.ДатаЗакрытия.АвтоОтметкаНезаполненного = Истина;
	Иначе	
		Элементы.ДатаЗакрытия.АвтоОтметкаНезаполненного = Ложь;
		ОтключитьОтметкуНезаполненного();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита ДатаЗакрытия.
//
Процедура ДатаЗакрытияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДатаЗакрытия) Тогда
		Объект.Закрыт = Истина;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "удалить" Тогда
		Объект.ДокументОснование = Неопределено;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(Неопределено);
		Модифицированность = Истина;
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "заполнить" Тогда
		ЗаполнитьПоОснованиюНачало();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "выбрать" Тогда
		//Выбрать основание
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаОснованияЗавершение", ЭтотОбъект);
		ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДокументОснование, Элементы.ДокументОснованиеНадпись);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "открыть" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) тогда
			возврат;
		КонецЕсли;
		
		РаботаСФормойДокументаКлиент.ОткрытьФормуДокументаПоТипу(Объект.ДокументОснование);
		
	КонецЕсли;
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ОбработкаНавигационнойСсылки");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаОснованияЗавершение(ВыбИмяФормы, Параметры) Экспорт
	
	Если ВыбИмяФормы<>Неопределено Тогда
		
		СтруктураПараметровОтбора = Новый Структура();
		_ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьОснованиеЗавершение", ЭтотОбъект);
		ОткрытьФорму(ВыбИмяФормы.Значение, СтруктураПараметровОтбора, ЭтотОбъект, ,,,_ОповещениеОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОснованиеЗавершение(ВыбЗначение, Параметры) Экспорт

	Если ВыбЗначение<>Неопределено Тогда
		Объект.ДокументОснование = ВыбЗначение;
		Элементы.ДокументОснованиеНадпись.Заголовок = РаботаСФормойДокументаКлиентСервер.СформироватьНадписьДокументОснование(ВыбЗначение);
		Модифицированность = Истина;
		
		ЗаполнитьПоОснованиюНачало();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюНачало() Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоОснованиюЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ОписаниеОповещения, 
		НСтр("ka='შევავსოთ დოკუმენტი არჩეული საფუძვლით?';ru='Заполнить документ по выбранному основанию?';en='Complete the document by the selected base?'"), 
		РежимДиалогаВопрос.ДаНет, 0);		

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованиюЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ЗаполнитьПоДокументу(Объект.ДокументОснование);
        УправлениеФормой();
    КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовПодвалаФормы

&НаСервере
Процедура ЗаполнитьСписокДокументОснование()
	
	СписокДокументОснование.Очистить();
	СписокДокументОснование.Добавить("Документ.ЗаказПокупателя.ФормаВыбора", "Заказ покупателя");
	СписокДокументОснование.Добавить("Документ.ЗаказНаПроизводство.ФормаВыбора", "Заказ на производство");
	СписокДокументОснование.Добавить("Документ.СборкаЗапасов.ФормаВыбора", "Сборка запасов");

КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОперации

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Период табличной части Операции.
//
Процедура ОперацииПериодПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Операции.ТекущиеДанные;
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ДатаОбработки", 	ТекущаяСтрока.Период);
	СтруктураДанные.Вставить("Номенклатура", 	ТекущаяСтрока.Операция);
	СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);	
	ТекущаяСтрока.Расценка = ПолучитьДанныеОперации(СтруктураДанные).Цена;
	
	РассчитатьСтоимость();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Операция табличной части Операции.
//
Процедура ОперацииОперацияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Операции.ТекущиеДанные;
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ДатаОбработки", 	ТекущаяСтрока.Период);
	СтруктураДанные.Вставить("Номенклатура", 	ТекущаяСтрока.Операция);
	СтруктураДанные.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	СтруктураРезультат 				= ПолучитьДанныеОперации(СтруктураДанные);
	ТекущаяСтрока.Расценка 			= СтруктураРезультат.Цена;
	ТекущаяСтрока.ЕдиницаИзмерения 	= СтруктураРезультат.ЕдиницаИзмерения;
	ТекущаяСтрока.НормаВремени 		= СтруктураРезультат.НормаВремени;
	
	РассчитатьДлительность();
	РассчитатьСтоимость();
	
КонецПроцедуры // ЗапасыНоменклатураПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Номенклатура.
//
Процедура ОперацииНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Операции.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.Спецификация = СтруктураДанные.Спецификация;
	
КонецПроцедуры // ОперацииНоменклатураПриИзменении()

// Процедура - обработчик события ПриИзменении поля ввода Характеристика.
//
&НаКлиенте
Процедура ОперацииХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Операции.ТекущиеДанные;
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	
	СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	СтрокаТабличнойЧасти.Спецификация = СтруктураДанные.Спецификация;
	
КонецПроцедуры // ОперацииХарактеристикаПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Количество табличной части Операции.
//
Процедура ОперацииКоличествоПриИзменении(Элемент)
	
	РассчитатьДлительность();
	РассчитатьСтоимость();
	ПересчитатьСуммуНДФЛиПФ();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита НормаВремени табличной части Операции.
//
Процедура ОперацииНормаВремениПриИзменении(Элемент)
	
	РассчитатьДлительность();
	РассчитатьСтоимость();
	ПересчитатьСуммуНДФЛиПФ();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Нормочасы табличной части Операции.
//
Процедура ОперацииНормочасыПриИзменении(Элемент)
	
	РассчитатьСтоимость();
	
КонецПроцедуры // ОперацииНормочасыПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Расценка табличной части Операции.
//
Процедура ОперацииРасценкаПриИзменении(Элемент)
	
	РассчитатьСтоимость();
	ПересчитатьСуммуНДФЛиПФ();

	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ОбработкаВыбора поля ввода ЕдиницаИзмерения.
//
Процедура ОперацииЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Операции.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.ЕдиницаИзмерения = ВыбранноеЗначение 
	 ИЛИ СтрокаТабличнойЧасти.Расценка = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКоэффициент = 0;
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		ТекущийКоэффициент = 1;
	КонецЕсли;
	
	Коэффициент = 0;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Если ТекущийКоэффициент = 0 И Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения, ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	ИначеЕсли Коэффициент = 0 Тогда
		СтруктураДанные = ПолучитьДанныеЕдиницаИзмеренияПриИзменении(,ВыбранноеЗначение);
	ИначеЕсли ТекущийКоэффициент = 1 И Коэффициент = 1 Тогда
		СтруктураДанные = Новый Структура("ТекущийКоэффициент, Коэффициент", 1, 1);
	КонецЕсли;
	
	Если СтруктураДанные.ТекущийКоэффициент <> 0 Тогда
		СтрокаТабличнойЧасти.Расценка = СтрокаТабличнойЧасти.Расценка * СтруктураДанные.Коэффициент / СтруктураДанные.ТекущийКоэффициент;
		СтрокаТабличнойЧасти.НормаВремени = СтрокаТабличнойЧасти.НормаВремени * СтруктураДанные.Коэффициент / СтруктураДанные.ТекущийКоэффициент;
		РассчитатьДлительность();
		РассчитатьСтоимость();
	КонецЕсли;
	
	РассчитатьСтоимость();
	
КонецПроцедуры // ЗапасыЕдиницаИзмеренияОбработкаВыбора()

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита Сотрудник табличной части СоставБригады.
//
Процедура СоставБригадыСотрудникПриИзменении(Элемент)
	
	Элементы.СоставБригады.ТекущиеДанные.КТУ = 1;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды ЗаполнитьСоставБригады.
//
Процедура ЗаполнитьСоставБригады(Команда)
	
	ЗаполнитьСоставБригадыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", УправлениеНебольшойФирмойСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаСервереБезКонтекста
// Получает набор данных с сервера.
//
Функция ПолучитьДанныеОрганизацияПриИзменении(Организация)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("Компания", УправлениеНебольшойФирмойСервер.ПолучитьОрганизацию(Организация));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры НоменклатураПриИзменении.
//
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	Если СтруктураДанные.Свойство("Характеристика") Тогда
		СтруктураДанные.Вставить("Спецификация", УправлениеНебольшойФирмойСервер.ПолучитьПоУмолчаниюСпецификацию(СтруктураДанные.Номенклатура, СтруктураДанные.Характеристика));
	Иначе
		СтруктураДанные.Вставить("Спецификация", УправлениеНебольшойФирмойСервер.ПолучитьПоУмолчаниюСпецификацию(СтруктураДанные.Номенклатура));
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаСервереБезКонтекста
// Получает табельный номер с сервера.
//
Функция ПолучитьТабНомер(Исполнитель)
	
	Возврат Исполнитель.Код;
	
КонецФункции // ПолучитьДанныеОрганизацияПриИзменении()

&НаСервере
// Процедура заполняет состав бригады.
//
Процедура ЗаполнитьСоставБригадыНаСервере()

	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьСоставБригады();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;	

	//lazare 21.07.2021
	ЗаполнитьНачисленияУдержанияНаСервере(Неопределено);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Получает набор данных с сервера для операции.
//
Функция ПолучитьДанныеОперации(СтруктураДанные)
	
	СтруктураДанные.Вставить("НормаВремени", СтруктураДанные.Номенклатура.НормаВремени);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", СтруктураДанные.Номенклатура.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("ВидЦен", Справочники.ВидыЦен.Учетная);
	СтруктураДанные.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	СтруктураДанные.Вставить("Коэффициент", 1);
	СтруктураДанные.Вставить("СуммаВключаетНДС", Справочники.ВидыЦен.Учетная.ЦенаВключаетНДС);
	
	СтруктураДанные.Вставить("Цена", УправлениеНебольшойФирмойСервер.ПолучитьЦенуНоменклатурыПоВидуЦен(СтруктураДанные));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеНоменклатураПриИзменении()

&НаСервереБезКонтекста
// Получает набор данных с сервера для процедуры ЕдиницаИзмеренияПриИзменении.
//
Функция ПолучитьДанныеЕдиницаИзмеренияПриИзменении(ТекущаяЕдиницаИзмерения = Неопределено, ЕдиницаИзмерения = Неопределено)
	
	СтруктураДанные = Новый Структура;
	
	Если ТекущаяЕдиницаИзмерения = Неопределено Тогда
		СтруктураДанные.Вставить("ТекущийКоэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("ТекущийКоэффициент", ТекущаяЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Если ЕдиницаИзмерения = Неопределено Тогда
		СтруктураДанные.Вставить("Коэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("Коэффициент", ЕдиницаИзмерения.Коэффициент);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеЕдиницаИзмеренияПриИзменении()

&НаКлиенте
// Процедура производит расчет длительности выполнения операций.
//
// Параметры:
//  Нет.
//
Процедура РассчитатьДлительность()

	ТекущаяСтрока = Элементы.Операции.ТекущиеДанные;
	ТекущаяСтрока.Нормочасы = ТекущаяСтрока.НормаВремени * ТекущаяСтрока.КоличествоФакт;	
	
КонецПроцедуры

&НаКлиенте
// Процедура производит расчет стоимости выполнения операций.
//
// Параметры:
//  Нет.
//
Процедура РассчитатьСтоимость()

	ТекущаяСтрока = Элементы.Операции.ТекущиеДанные;
	//ТекущаяСтрока.Стоимость = ТекущаяСтрока.Расценка * ТекущаяСтрока.КоличествоФакт;
	ТекущаяСтрока.Стоимость = ТекущаяСтрока.Расценка * ТекущаяСтрока.НормаВремени * ТекущаяСтрока.КоличествоФакт ; //++Lazare
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументу(ДокОснование)
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.Заполнить(ДокОснование);
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;
		
КонецПроцедуры // ЗаполнитьПоДокументу()

#КонецОбласти

#Область УправлениеВнешнимВидомФормы

&НаКлиенте
// Процедура устанавливает доступность элементов формы в зависимости от типа исполнителя.
//
// Параметры:
//  Нет.
//
Процедура УправлениеФормой()
	
	Если ТипЗнч(Объект.Исполнитель) = Тип("СправочникСсылка.Бригады") Тогда
		
		Элементы.ГруппаСоставБригады.Видимость 				= Истина;
		Элементы.ЗаполнитьСоставБригады.Видимость 			= Истина;
		Элементы.Исполнитель.МаксимальнаяШирина				= 36;
		Элементы.ТабНомер.Видимость 						= Ложь;
		Элементы.НДФиПФ.Видимость 							= Ложь;
		
	Иначе
		
		Элементы.ГруппаСоставБригады.Видимость 				= Ложь;
		Элементы.ЗаполнитьСоставБригады.Видимость 			= Ложь;
		Элементы.Исполнитель.МаксимальнаяШирина				= 31;
		Элементы.ТабНомер.Видимость 						= Истина;
		Элементы.НДФиПФ.Видимость 							= Истина;
		Объект.СоставБригады.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьИДоступность()

#КонецОбласти

#Область ЗаполнениеОбъектов

&НаКлиенте
Процедура СохранитьДокументКакШаблон(Параметр) Экспорт
	
	ЗаполнениеОбъектовУНФКлиент.СохранитьДокументКакШаблон(Объект, ОтображаемыеРеквизиты(), Параметр);
	
КонецПроцедуры

&НаСервере
Функция ОтображаемыеРеквизиты()
	
	Возврат ЗаполнениеОбъектовУНФ.ОтображаемыеРеквизиты(ЭтотОбъект);
	
КонецФункции

#КонецОбласти

#Область КопированиеСтрокТабличныхЧастей

// Процедура - обработчик нажатия кнопки Копировать строки в ТЧ Операции.
//
&НаКлиенте
Процедура ОперацииКопироватьСтроки(Команда)
	
	КопироватьСтроки("Операции");
	
КонецПроцедуры

// Процедура - обработчик нажатия кнопки Вставить строки в ТЧ Операции.
//
&НаКлиенте
Процедура ОперацииВставитьСтроки(Команда)
	
	ВставитьСтроки("Операции");
	
КонецПроцедуры

// Вызывает процедуру копирования строк и оповещает пользователя о количестве скопированных.
//
&НаКлиенте
Процедура КопироватьСтроки(ИмяТЧ)
	
	Если КопированиеТабличнойЧастиКлиент.МожноКопироватьСтроки(Объект[ИмяТЧ], Элементы[ИмяТЧ].ТекущиеДанные) Тогда
		КоличествоСкопированных = 0;
		КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных);
		КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОКопированииСтрок(КоличествоСкопированных);
	КонецЕсли;
	
КонецПроцедуры

// Вызывает процедуру вставки строк и оповещает пользователя о количетсве вставленных.
//
&НаКлиенте
Процедура ВставитьСтроки(ИмяТЧ)
	
	КоличествоСкопированных = 0;
	КоличествоВставленных = 0;
	ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных);
	КопированиеТабличнойЧастиКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоСкопированных, КоличествоВставленных);
	
КонецПроцедуры

// Выполняет копирование выделенных строк в буфер обмена.
//
&НаСервере
Процедура КопироватьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных)
	
	КопированиеТабличнойЧастиСервер.Копировать(Объект[ИмяТЧ], Элементы[ИмяТЧ].ВыделенныеСтроки, КоличествоСкопированных);
	
КонецПроцедуры

// Вставляет скопированные строки из буфера обмена в выбранную табличную часть.
//
&НаСервере
Процедура ВставитьСтрокиНаСервере(ИмяТЧ, КоличествоСкопированных, КоличествоВставленных)
	
	КопированиеТабличнойЧастиСервер.Вставить(Объект, ИмяТЧ, Элементы, КоличествоСкопированных, КоличествоВставленных);
	ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных);
	
КонецПроцедуры

// Обрабатывает вставленные строки.
//
&НаСервере
Процедура ОбработатьВставленныеСтрокиНаСервере(ИмяТЧ, КоличествоВставленных)
	
	Количество = Объект[ИмяТЧ].Количество();
	Для Итератор = 1 По КоличествоВставленных Цикл
		Строка = Объект[ИмяТЧ][Количество - Итератор];
		
		Если НЕ ЗначениеЗаполнено(Строка.Спецификация) Тогда
			СтруктураДанные = Новый Структура;
			СтруктураДанные.Вставить("Номенклатура", Строка.Номенклатура);
			СтруктураДанные.Вставить("Характеристика", Строка.Характеристика);
			
			СтруктураДанные = ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
			Строка.Спецификация = СтруктураДанные.Спецификация;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти


//++Lazare21.07.2021
&НаКлиенте
Процедура Заполнить(Команда)

 ПолучитьКоефициентысотрудниковИЗаполнитьНалоги (Объект.Ссылка);	
 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачисленияУдержанияНаСервере(МассивСотрудников)
	
	Если ТипЗнч(Объект.Исполнитель) = Тип("СправочникСсылка.Бригады") Тогда
		МассивСотрудников = Объект.СоставБригады.Выгрузить().ВыгрузитьКолонку("Сотрудник");
		ТаблицаВидовУдержания = ПолучитьВидыУдержания(МассивСотрудников);
		Для Каждого СтрокаТЧ ИЗ Объект.СоставБригады Цикл 
			НайденныеСтавкиТекСотрудника = ТаблицаВидовУдержания.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник));
			Если НайденныеСтавкиТекСотрудника.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, НайденныеСтавкиТекСотрудника[0]);		
			Иначе
				СтрокаТЧ.ВидУдержанияНДФЛ 	= Неопределено;
				СтрокаТЧ.ВидУдержанияПФ 	= Неопределено;
				СтрокаТЧ.СуммаНДФЛ 			= 0;
				СтрокаТЧ.СуммаПФ 			= 0;
				СтрокаТЧ.СуммаЛгот 			= 0;
			КонецЕсли;
		КонецЦикла;
		
	Иначе 	
		Сотрудник = МассивСотрудников ;
		ТаблицаВидовУдержания   = ПолучитьВидыУдержания(Сотрудник);
		Если ТаблицаВидовУдержания.Количество() > 0 Тогда 
			Для Каждого Стр Из ТаблицаВидовУдержания Цикл 
				Объект.ВидУдержанияНДФЛ = Стр.ВидУдержанияНДФЛ;
				Объект.ВидУдержанияПФ   = Стр.ВидУдержанияПФ;	
			КонецЦикла;
		Иначе 
			Объект.ВидУдержанияНДФЛ  = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
			Объект.ВидУдержанияПФ    = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
		КонецЕсли;
		ПересчитатьСуммуНДФЛиПФ();	
	КонецЕсли;
	
		
КонецПроцедуры

Функция ПолучитьВидыУдержания(МассивСотрудников)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ДатаЗакрытия", 		Объект.ДатаЗакрытия);
	Запрос.Параметры.Вставить("МассивСотрудников", 	МассивСотрудников);	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСрезПоследних.Сотрудник,
		|	СотрудникиСрезПоследних.ВидУдержанияПФ,
		|	СотрудникиСрезПоследних.ВидУдержанияНДФЛ,
		|	СотрудникиСрезПоследних.ВидУдержанияНДФЛ.СтавкаНДФЛ КАК СтавкаНДФЛ,
		|	СотрудникиСрезПоследних.ВидУдержанияПФ.СтавкаПФ КАК СтавкаПФ
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПоследних(&ДатаЗакрытия, Сотрудник В (&МассивСотрудников)) КАК СотрудникиСрезПоследних";
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&НаКлиенте
Процедура СоставБригадыВидУдержанияНДФЛПриИзменении(Элемент)
	
	//ПересчитатьСуммыСтрокиСоставБригады(Элементы.СоставБригады.ТекущаяСтрока, "ВидУдержанияНДФЛ");

КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыСтрокиСоставБригады(Идентификатор, ИмяПоля)
	Если Идентификатор = Неопределено Тогда
		Для Каждого СтрокаТЧ ИЗ Объект.СоставБригады Цикл
			Идентификатор = СтрокаТЧ.ПолучитьИдентификатор();
			ТекДанные = Объект.СоставБригады.НайтиПоИдентификатору(Идентификатор);
			//РС_ОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная(ИмяПоля, ТекДанные, Объект.СуммаВключаетНДС);
		КонецЦикла;
	Иначе
		ТекДанные = Объект.СоставБригады.НайтиПоИдентификатору(Идентификатор);
		//РС_ОбщегоНазначения.ПересчитатьСуммыСтрокиРасхода_ПриходнаяНакладная(ИмяПоля, ТекДанные, Объект.СуммаВключаетНДС);
		ПересчитатьСуммыСтрокиСоставБригады_СоставБригады(ИмяПоля, ТекДанные);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПересчитатьСуммыСтрокиСоставБригады_СоставБригады(ИмяПоля, ТекДанные)
	
Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.Свойство("ВидУдержанияНДФЛ") Тогда 	
		СтавкаНДФЛ = ТекДанные.ВидУдержанияНДФЛ.СтавкаНДФЛ ;
	КонецЕсли;
	Если ТекДанные.Свойство("ВидУдержанияПФ") Тогда 
		СтавкаПФ   = ТекДанные.ВидУдержанияПФ.СтавкаПФ ;
	КонецЕсли;
	
	ПересчитатьЦену = Истина;	
	
	Сумма = 0 ;
	Если Объект.Операции.Количество()> 0 Тогда 
		Для Каждого Стр  из Объект.Операции Цикл 		
			Сумма =  Сумма + Стр.Стоимость ;
		КонецЦикла;
	КонецЕсли;
	
	//получитьКоефициентсотрудников(Сумма);Коэффициент
	
	СуммаКТУ = 0;
	Если Объект.СоставБригады.Количество()> 0 Тогда 
		Для Каждого Стр  из Объект.СоставБригады Цикл 		
			СуммаКТУ =  СуммаКТУ + Стр.КТУ ;
		КонецЦикла;
		
		Для Каждого Стр  из Объект.СоставБригады Цикл 		
			Стр.Коэффициент =  Стр.КТУ / СуммаКТУ ;
		КонецЦикла;
		
	КонецЕсли;
	
	
	Если ИмяПоля = "СуммаБезНалогов" ИЛИ ИмяПоля = "ВидУдержанияНДФЛ" ИЛИ ИмяПоля = "ВидУдержанияПФ" Тогда		
		//Если ИмяПоля = "ВидУдержанияНДФЛ"  Тогда 		
		СуммаНДФЛ = Окр(Сумма/((100-СтавкаНДФЛ)/100)*(СтавкаНДФЛ/100), 2);
		СуммаПФ	  = Окр(((Сумма+СуммаНДФЛ)/((100-СтавкаПФ)/100))*(СтавкаПФ/100), 2);
		Всего =  СуммаНДФЛ + СуммаПФ ;
	КонецЕсли;

	ТекДанные.СуммаНДФЛ = СуммаНДФЛ ;
	ТекДанные.СуммаПФ   = СуммаПФ ;
	
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура  ПолучитьКоефициентысотрудниковИЗаполнитьНалоги(ДокументСсылкаСдельныйНаряд)
	
	СуммаДокумента = 0 ;
	СуммаДокумента1 =  Объект.Операции.Итог("Стоимость");
	Если  Объект.Операции.Количество()> 0 Тогда 
		Для Каждого Стр  из Объект.Операции Цикл 		
			СуммаДокумента =  СуммаДокумента + Стр.Стоимость ;
		КонецЦикла;	
	Иначе 
		Возврат ;	
	КонецЕсли;
	
	СуммаКТУ = 0;
	
	Если Объект.СоставБригады.Количество()> 0 Тогда
		
		Для Каждого Стр  из Объект.СоставБригады Цикл 		
			СуммаКТУ =  СуммаКТУ + Стр.КТУ ;	
		КонецЦикла;
		
		Для Каждого Стр  из Объект.СоставБригады Цикл 		
			Стр.Коэффициент =  Стр.КТУ / СуммаКТУ ;
			Стр.Сумма       =  Окр(СуммаДокумента * Стр.Коэффициент, 2);			
			СтавкаНДФЛ  	=  Стр.ВидУдержанияНДФЛ.СтавкаНДФЛ ;
			СтавкаПФ    	=  Стр.ВидУдержанияПФ.СтавкаПФ ;					
			Стр.СуммаПФ		=  Окр(Стр.Сумма * СтавкаПФ/100, 2);
			Стр.СуммаНДФЛ	=  Окр((Стр.Сумма-Стр.СуммаПФ) * СтавкаНДФЛ/100, 2);
			Стр.СуммаБезНалогов = Стр.Сумма - Стр.СуммаПФ - Стр.СуммаНДФЛ ;
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидУдержанияНДФЛПриИзменении(Элемент)
	ПересчитатьСуммуНДФЛиПФ();
КонецПроцедуры
	
	&НаКлиенте
Процедура ВидУдержанияПФПриИзменении(Элемент)
	ПересчитатьСуммуНДФЛиПФ();
КонецПроцедуры

&НаКлиенте
Процедура ОперацииСтоимостьПриИзменении(Элемент)
	ПересчитатьСуммуНДФЛиПФ();
КонецПроцедуры
	
&НаСервере
Процедура ПересчитатьСуммуНДФЛиПФ()
	
	СтавкаНДФЛ	= 0;
	СтавкаПФ	= 0;
	
	Если ЗначениеЗаполнено(Объект.ВидУдержанияНДФЛ) Тогда
		СтавкаНДФЛ = Объект.ВидУдержанияНДФЛ.СтавкаНДФЛ;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВидУдержанияПФ) Тогда
		СтавкаПФ = Объект.ВидУдержанияПФ.СтавкаПФ;
	КонецЕсли;
		
	Объект.СуммаПФ		=  Окр(Объект.Операции.Итог("Стоимость") * СтавкаПФ/100, 2);	
	Объект.СуммаНДФЛ	=  Окр((Объект.Операции.Итог("Стоимость")-Объект.СуммаПФ) * СтавкаНДФЛ/100, 2);
			
КонецПроцедуры // ПересчитатьСуммуНДФЛЗарплаты()

&НаКлиенте
Процедура ИсполнительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда 
		//массив = Новый Массив(1) ;
		//массив[0] = ВыбранноеЗначение ;	
		ЗаполнитьНачисленияУдержанияНаСервере(ВыбранноеЗначение);
		//ТаблицаВидовУдержания = ПолучитьВидыУдержания(массив); //Lazare 29.07.2021	
	КонецЕсли;
КонецПроцедуры

//--Lazare21.07.2021
